[
	{
		"Name":"Background questionnaire",
		"Description":"Before the very beginning of the lectures, the pre-tests/questionnaire can be conducted in order to estimates students' level of knowledge and their background. The level of difficulty, the manner of lecturing, the expected outcomes can be adjusted based on the result of the background questionnaire. It can also be done during the courses in order to check the students implicit impression about what they are learning and what they learned. It will be recommended to use this just for getting some insight about students' background knowledge, not for “grading” them. It will be also good to ask students what they learned during courses compared to their background using the same questionnaire at the end of course, in order to verify how the effectively lectures went as expected.",
		"SMALL":"1",
		"MEDIUM":"1",
		"LARGE":"1",
		"MASSIVE":"1",
		"online":"1",
		"written":"1",
		"oral":"0",
		"comments":"0",
		"activating":"1",
		"quiz":"1",
		"prepared form":"1",
		"during the course":"0",
		"after the course":"0",
		"not anonymous":"1",
		"anonymous":"0",
		"in-class time":"0",
		"no in-class time":"1",
		"for evaluation":"0",
		"not for evaluation":"1",
		"st-st interaction":"0",
		"st-tch interaction":"1",
		"peer to peer feedback":"0",
		"qualitative":"1",
		"quantitative":"1",
		"export":"0",
		"no export":"0",
		"real time":"0"
	},
	{
		"Name":"Course blog",
		"Description":"The instructor/assistants build a blog for a given course. A free online platform could be (and has been) used for that such as wordpress. The blog can be used as the main resource for the course, for discussion on specific topics of the course, for providing additional resources, for activating students and providing a platform for further discussion, questions, and interactions. For example, after each teaching session the instructor completes a short diary of the days activities which summarizes the content, teaching methods, and outcomes of the day. This log is complemented by further questions, exercises, and stimulating discussion topics. The instructor, assitants, and the students can use the comments section of the blog to further explore the subject, clarify issues, ask questions, and discuss with their peers.",
		"SMALL":"1",
		"MEDIUM":"1",
		"LARGE":"0",
		"MASSIVE":"0",
		"online":"1",
		"written":"1",
		"oral":"0",
		"comments":"1",
		"activating":"1",
		"quiz":"0",
		"prepared form":"0",
		"during the course":"1",
		"after the course":"0",
		"not anonymous":"1",
		"anonymous":"1",
		"in-class time":"0",
		"no in-class time":"1",
		"for evaluation":"0",
		"not for evaluation":"1",
		"st-st interaction":"1",
		"st-tch interaction":"1",
		"peer to peer feedback":"0",
		"qualitative":"1",
		"quantitative":"0",
		"export":"1",
		"no export":"0",
		"real time":"1"
	},
	{
		"Name":"Course feedback form",
		"Description":"After the course ends, students fill a feedback form to grade and provide feedback for the course. There is a fixed set of questions which are used to evaluate all the courses held in Aalto University, and also, to improve them. After students have given course feedback, the course feedback system will produce reports which show the statistics of different evaluations.",
		"SMALL":"0",
		"MEDIUM":"1",
		"LARGE":"1",
		"MASSIVE":"1",
		"online":"1",
		"written":"0",
		"oral":"0",
		"comments":"1",
		"activating":"0",
		"quiz":"1",
		"prepared form":"1",
		"during the course":"0",
		"after the course":"1",
		"not anonymous":"0",
		"anonymous":"1",
		"in-class time":"0",
		"no in-class time":"1",
		"for evaluation":"0",
		"not for evaluation":"1",
		"st-st interaction":"0",
		"st-tch interaction":"0",
		"peer to peer feedback":"0",
		"qualitative":"1",
		"quantitative":"1",
		"export":"1",
		"no export":"0",
		"real time":"0"
	},
	{
		"Name":"email",
		"Description":"This feedback method simply uses email messages to gather and provide feedback and requests from/to the students. Students can easily communicate with the teachers to ask questions or clarifications or provide comments. Since mobile internet connection is widely available the use of emails can allow a fast response if the teacher actively checks the messages and timely replies. Some possible drawbacks include the need of managing a possibly very large number of messages with the risk of missing some of them, and possibly a significant amount of time needed to constantly monitor and reply to the messages. The method could be more organized or improved by setting up a dedicated mailing list.",
		"SMALL":"1",
		"MEDIUM":"1",
		"LARGE":"0",
		"MASSIVE":"0",
		"online":"1",
		"written":"1",
		"oral":"0",
		"comments":"0",
		"activating":"0",
		"quiz":"0",
		"prepared form":"0",
		"during the course":"1",
		"after the course":"0",
		"not anonymous":"1",
		"anonymous":"0",
		"in-class time":"0",
		"no in-class time":"1",
		"for evaluation":"0",
		"not for evaluation":"1",
		"st-st interaction":"0",
		"st-tch interaction":"1",
		"peer to peer feedback":"0",
		"qualitative":"1",
		"quantitative":"0",
		"export":"0",
		"no export":"1",
		"real time":"1"
	},
	{
		"Name":"etherpad",
		"Description":"Here one can create a document (with very basic editing options) that can be accessed simultaneously by different users. Each user has a different color and the cursor moves real-time as different people edit the document. Etherpad could be used in group-work, where the members of the group can follow what their colleagues are thinking, writing, or editing. It could thus be a platform for a simple collaborative project. In terms of feedback, it could be used for example by opening an etherpad document, giving access to a classroom, posing a question, and allowing all users to see the answers, simultaneously. It could also be used as a platform for response letters. That is, students give their feedback in written form, can see their colleagues's feedback, and the instructor can summarize and address the feedback gathered by the students, address their problems, and create an atmoshpere of interaction and communication.",
		"SMALL":"1",
		"MEDIUM":"0",
		"LARGE":"0",
		"MASSIVE":"0",
		"online":"1",
		"written":"1",
		"oral":"0",
		"comments":"1",
		"activating":"1",
		"quiz":"0",
		"prepared form":"0",
		"during the course":"1",
		"after the course":"0",
		"not anonymous":"0",
		"anonymous":"1",
		"in-class time":"0",
		"no in-class time":"1",
		"for evaluation":"0",
		"not for evaluation":"1",
		"st-st interaction":"1",
		"st-tch interaction":"1",
		"peer to peer feedback":"0",
		"qualitative":"1",
		"quantitative":"0",
		"export":"1",
		"no export":"0",
		"real time":"1"
	},
	{
		"Name":"Feedback from peer teachers",
		"Description":"Some teachers of other courses (feedback teachers) attend one or more teaching events and then provide feedback based on their experience and perceptions. This kind of feedback can be a useful complement to the student feedback since it comes from a different perspective. Feedback teachers may be more experienced in providing feedback and may put more focus on providing constructive comments. Moreover, the feedback received in this way would implicitly benefit from the other teachers experience in their own courses. Possible drawbacks include the fact that the method requires extra time and commitment from other teachers, and the fact that the scope of feedback provided in this way is restricted to the teaching events attended by the feedback teachers and not to the whole course. Moreover, some aspects such as for example workload or level of difficulty for the students may be difficult to be evaluated in this way.",
		"SMALL":"1",
		"MEDIUM":"1",
		"LARGE":"1",
		"MASSIVE":"1",
		"online":"0",
		"written":"1",
		"oral":"1",
		"comments":"1",
		"activating":"0",
		"quiz":"0",
		"prepared form":"0",
		"during the course":"1",
		"after the course":"0",
		"not anonymous":"0",
		"anonymous":"0",
		"in-class time":"0",
		"no in-class time":"1",
		"for evaluation":"0",
		"not for evaluation":"1",
		"st-st interaction":"0",
		"st-tch interaction":"0",
		"peer to peer feedback":"1",
		"qualitative":"1",
		"quantitative":"0",
		"export":"0",
		"no export":"1",
		"real time":"0"
	},
	{
		"Name":"Homework embedded feedback",
		"Description":"When students submit their homeworks or assignment, they can add some comments about the course. Possible comments include the workload of performing the homeworks, the problems or issues raised during trying to do the assignment, questions from the courses, and the general feedback of the course (after the end of course). Response letter would be written by the teacher based on those feedbacks given by students. The students can be encouraged by receiving the response letter because they fell the lectures and the assignment seems to be interactive and bidirectional. The scope of lectures or guide for the assignment will be updated based on the feedback.",
		"SMALL":"1",
		"MEDIUM":"1",
		"LARGE":"1",
		"MASSIVE":"1",
		"online":"1",
		"written":"1",
		"oral":"0",
		"comments":"1",
		"activating":"0",
		"quiz":"0",
		"prepared form":"1",
		"during the course":"1",
		"after the course":"0",
		"not anonymous":"1",
		"anonymous":"0",
		"in-class time":"0",
		"no in-class time":"1",
		"for evaluation":"0",
		"not for evaluation":"1",
		"st-st interaction":"0",
		"st-tch interaction":"1",
		"peer to peer feedback":"0",
		"qualitative":"1",
		"quantitative":"1",
		"export":"0",
		"no export":"0",
		"real time":"0"
	},
	{
		"Name":"In-class feedback forms",
		"Description":"After a teaching activity, such as a lecture, ends, a student fills a form that is used for evaluating the suitability of used learning activities for learning the intended learning outcomes. The questionnaire can consists of Likert scales and free form answers.",
		"SMALL":"0",
		"MEDIUM":"1",
		"LARGE":"1",
		"MASSIVE":"1",
		"online":"0",
		"written":"1",
		"oral":"0",
		"comments":"1",
		"activating":"1",
		"quiz":"0",
		"prepared form":"1",
		"during the course":"1",
		"after the course":"0",
		"not anonymous":"0",
		"anonymous":"1",
		"in-class time":"1",
		"no in-class time":"0",
		"for evaluation":"0",
		"not for evaluation":"1",
		"st-st interaction":"0",
		"st-tch interaction":"1",
		"peer to peer feedback":"0",
		"qualitative":"1",
		"quantitative":"1",
		"export":"1",
		"no export":"0",
		"real time":"0"
	},
	{
		"Name":"In-class interactive activity",
		"Description":"The teacher introduces the brief summary of previous lectures not only to reflect what students learned beforehand, but also to give tips for those who were absent in the previous one. However, the teacher will not directly instruct the contents but start with asking some opinions about what student got feeling and what were the gotten outcome from the last time. Based on the answers, the other students, instead of teacher, can give the comments or the arguments or raise questions. Here the role of teacher is not giving the answer but guiding the natural discussions and throwing the topics, which is needed for reflecting the previous gotten knowledge and for helping to understand the expected outcomes of that day.",
		"SMALL":"1",
		"MEDIUM":"0",
		"LARGE":"0",
		"MASSIVE":"0",
		"online":"0",
		"written":"0",
		"oral":"1",
		"comments":"1",
		"activating":"1",
		"quiz":"0",
		"prepared form":"0",
		"during the course":"1",
		"after the course":"0",
		"not anonymous":"1",
		"anonymous":"0",
		"in-class time":"1",
		"no in-class time":"0",
		"for evaluation":"0",
		"not for evaluation":"1",
		"st-st interaction":"1",
		"st-tch interaction":"1",
		"peer to peer feedback":"1",
		"qualitative":"1",
		"quantitative":"0",
		"export":"0",
		"no export":"1",
		"real time":"0"
	},
	{
		"Name":"Learning diary",
		"Description":"The student keeps a learning diary. After each lecture the student records, for example, two or three new topics that he/she learned during the lecture, and also two or three topics that are still unlear. The teacher can follow the student's learning diary and hence evaluate the learning process and measure whether the given learning outcomes have been achieved. Moreover, keeping a learning diary helps to structure the student's learning process throught the course. ",
		"SMALL":"1",
		"MEDIUM":"0",
		"LARGE":"0",
		"MASSIVE":"0",
		"online":"0",
		"written":"1",
		"oral":"0",
		"comments":"1",
		"activating":"1",
		"quiz":"0",
		"prepared form":"0",
		"during the course":"1",
		"after the course":"0",
		"not anonymous":"1",
		"anonymous":"0",
		"in-class time":"0",
		"no in-class time":"1",
		"for evaluation":"1",
		"not for evaluation":"0",
		"st-st interaction":"0",
		"st-tch interaction":"1",
		"peer to peer feedback":"0",
		"qualitative":"1",
		"quantitative":"0",
		"export":"1",
		"no export":"1",
		"real time":"0"
	},
	{
		"Name":"Padlet",
		"Description":"Padlet is a replacement for Post-it notes. In addition to text, users can add videos and images. A teacher creates and provides a unique URL for a wall where students can write their comments and include images, videos etc.  This method could be used to collect various kind of information such as an overview of the important concepts from the lecture, problems during the lecture.",
		"SMALL":"1",
		"MEDIUM":"1",
		"LARGE":"1",
		"MASSIVE":"1",
		"online":"0",
		"written":"1",
		"oral":"0",
		"comments":"1",
		"activating":"1",
		"quiz":"0",
		"prepared form":"0",
		"during the course":"1",
		"after the course":"0",
		"not anonymous":"0",
		"anonymous":"1",
		"in-class time":"1",
		"no in-class time":"1",
		"for evaluation":"0",
		"not for evaluation":"1",
		"st-st interaction":"1",
		"st-tch interaction":"1",
		"peer to peer feedback":"1",
		"qualitative":"1",
		"quantitative":"0",
		"export":"1",
		"no export":"0",
		"real time":"1"
	},
	{
		"Name":"Piazza discussion forum",
		"Description":"Piazza is an easy-to-use online platform for questions and answers in wiki-style format. On Piazza students are teaching students and real-time conversations can continue after lectures and office hours. Anyone can ask and answer questions on Piazza, publicly or anonymously. Teacher endorsements of good questions and answers let the teacher push the class in the right direction. The questions that students post can be used to gauge what topics and assignments are confusing or easy, and who needs additional instruction. The teacher can use Piazza also for anonymous feedback by posting a poll after a lecture. Piazza can be used also for anonymous private posts to the teacher.",
		"SMALL":"1",
		"MEDIUM":"1",
		"LARGE":"1",
		"MASSIVE":"1",
		"online":"1",
		"written":"1",
		"oral":"0",
		"comments":"1",
		"activating":"1",
		"quiz":"0",
		"prepared form":"0",
		"during the course":"1",
		"after the course":"0",
		"not anonymous":"1",
		"anonymous":"1",
		"in-class time":"0",
		"no in-class time":"1",
		"for evaluation":"1",
		"not for evaluation":"0",
		"st-st interaction":"1",
		"st-tch interaction":"1",
		"peer to peer feedback":"1",
		"qualitative":"1",
		"quantitative":"0",
		"export":"1",
		"no export":"0",
		"real time":"1"
	},
	{
		"Name":"Presemo",
		"Description":"Presemo is a tool for a teacher to present questions to students during a lecture, and thus, it replaces typical oral questions. A teacher can use this tool to estimate how well students have understood the topics to be learned or for collecting comments. In Presemo, a teacher sets up a room for the course or a single lecture. Then, the teacher can create activities such as a discussion, voting or a quiz. The room and activities should be done before the actual lecture, and thus, this method is not good for spontaneous questions. After students respond to a question presented in the activity, the teacher can present a summary of responses and choose the next action based on the results.",
		"SMALL":"1",
		"MEDIUM":"1",
		"LARGE":"1",
		"MASSIVE":"1",
		"online":"1",
		"written":"1",
		"oral":"0",
		"comments":"1",
		"activating":"1",
		"quiz":"1",
		"prepared form":"1",
		"during the course":"1",
		"after the course":"0",
		"not anonymous":"0",
		"anonymous":"1",
		"in-class time":"1",
		"no in-class time":"0",
		"for evaluation":"1",
		"not for evaluation":"0",
		"st-st interaction":"0",
		"st-tch interaction":"1",
		"peer to peer feedback":"0",
		"qualitative":"1",
		"quantitative":"1",
		"export":"0",
		"no export":"0",
		"real time":"1"
	},
	{
		"Name":"Stack Overflow",
		"Description":"_stack overflow_ is a public question and answer site where it is possible to post questions or answer other users' questions. In addition to post answers, it is also possible to post comments to other users' answers. Questions can be classified into thematic areas by associating tags to them. There is also a voting system that allows users to vote the answers or comments received so that among all the answers  to the same question those with higher number of votes will appear first. Users can decide to be anonymous by adopting a nickname. The teacher of a course and the students can use the system to post questions and answers related with the course. Since anyone can reply to a question, student peer discussion is encouraged. Besides answering the questions directly, the teacher can also encourage other students to reply, and can only participate to guide the discussion by commenting the students answers or provide clarifications when needed. Possible drawbacks include the fact that the discussion cannot me made private for the course (any user of the site can post answers or comments).",
		"SMALL":"1",
		"MEDIUM":"1",
		"LARGE":"1",
		"MASSIVE":"1",
		"online":"1",
		"written":"1",
		"oral":"0",
		"comments":"1",
		"activating":"1",
		"quiz":"0",
		"prepared form":"0",
		"during the course":"1",
		"after the course":"0",
		"not anonymous":"0",
		"anonymous":"1",
		"in-class time":"0",
		"no in-class time":"1",
		"for evaluation":"0",
		"not for evaluation":"1",
		"st-st interaction":"1",
		"st-tch interaction":"1",
		"peer to peer feedback":"1",
		"qualitative":"1",
		"quantitative":"0",
		"export":"0",
		"no export":"0",
		"real time":"1"
	},
	{
		"Name":"Student messenger groups",
		"Description":"This feedback method relies on a small group of students among those attending the course called “messengers” which will assume the role of intermediaries between the teacher and the rest of the class. The role of messengers is to discuss with the other students to bring up possible issues or questions which are relevant to the entire class and discuss them with the teachers. The messengers and teachers can meet at different times during the course, for example after each main thematic part of the course, to keep the teacher informed on the students point of view and possibly suggest some changes or adjustments. The main difference with respect to the student messenger type of feedback is that in this case the messengers change at each meeting thus giving the opportunity to more students of actively participating. One possible drawback is that it may be difficult and/or time consuming to organize a different messenger group for each meeting, and it can be difficult for the messenger group to discuss with the other students before each meeting with the teacher.",
		"SMALL":"1",
		"MEDIUM":"1",
		"LARGE":"0",
		"MASSIVE":"0",
		"online":"0",
		"written":"0",
		"oral":"1",
		"comments":"1",
		"activating":"1",
		"quiz":"0",
		"prepared form":"0",
		"during the course":"1",
		"after the course":"0",
		"not anonymous":"0",
		"anonymous":"0",
		"in-class time":"1",
		"no in-class time":"0",
		"for evaluation":"0",
		"not for evaluation":"1",
		"st-st interaction":"1",
		"st-tch interaction":"1",
		"peer to peer feedback":"1",
		"qualitative":"0",
		"quantitative":"0",
		"export":"0",
		"no export":"1",
		"real time":"0"
	},
	{
		"Name":"Student messengers",
		"Description":"Two to five students are chosen in the beginning of the course so as to form one student messenger group. The group's task is to collect feedback by meeting and discussing with other students during the course. The teacher has an important task to brief the students in the messenger group so that the group is both willing and able to collect feedback and to talk with the students throughout the course. The teacher organizes regular meetings with the group to go through the given feedback and thoughts on the course.",
		"SMALL":"0",
		"MEDIUM":"1",
		"LARGE":"1",
		"MASSIVE":"1",
		"online":"0",
		"written":"0",
		"oral":"1",
		"comments":"1",
		"activating":"0",
		"quiz":"0",
		"prepared form":"0",
		"during the course":"1",
		"after the course":"0",
		"not anonymous":"0",
		"anonymous":"1",
		"in-class time":"1",
		"no in-class time":"1",
		"for evaluation":"0",
		"not for evaluation":"1",
		"st-st interaction":"1",
		"st-tch interaction":"1",
		"peer to peer feedback":"1",
		"qualitative":"1",
		"quantitative":"0",
		"export":"0",
		"no export":"1",
		"real time":"0"
	},
	{
		"Name":"Wiki",
		"Description":"The instructor/assistants of the course create a course wiki. The instructor can upload material related to the course, provided further resources, give quizzes and pose questions for further discussion. There can be a part of the course wiki dedicated to discussion. The students are encouraged to leave comments, ask questions, and reply to questions. One way to encourage this is to reward the participation, and not grade the comments. This is alternative to Aalto's noppa and moodle, as it provides similar, and in some cases more flexible interface, but also similar to piazza, or using a course blog. A wiki offers some possibilities for evaluation, as it can be essentially used as a student diary, that the instructor of the course follows.",
		"SMALL":"1",
		"MEDIUM":"1",
		"LARGE":"0",
		"MASSIVE":"0",
		"online":"1",
		"written":"1",
		"oral":"0",
		"comments":"1",
		"activating":"1",
		"quiz":"0",
		"prepared form":"0",
		"during the course":"1",
		"after the course":"0",
		"not anonymous":"1",
		"anonymous":"0",
		"in-class time":"0",
		"no in-class time":"1",
		"for evaluation":"1",
		"not for evaluation":"1",
		"st-st interaction":"1",
		"st-tch interaction":"1",
		"peer to peer feedback":"0",
		"qualitative":"1",
		"quantitative":"1",
		"export":"1",
		"no export":"0",
		"real time":"1"
	}
]
